/*********************************************************************************
* 
*	E5_02
	프로그램에서()뿐만 아니라 {}도 사용할 수 있도록 기능을 추가하라.
	예: {(4 + 5) * 6} / (3 + 4)가 유효한 표현식이 되도록 구현하라.

	E5_03
	팩토리얼 연산자를 추가하라.접미사 !연산자를 사용하여 팩토리얼을 표현한다.
	예 : 7!은 7 * 6 * 5 * 4 * 3 * 2 * 1을 의미한다. 
	!연산자는*, / 보다 우선순위가 높아야 하며, 7 * 8!은(7 * (8!))로 해석되어야 한다.
	먼저 문법을 수정하여 상위 연산자를 반영하라.표준 수학 정의에 따라 
	0!은 1로 평가되어야 한다.
	힌트 : 계산기 함수는 double을 사용하지만, 
	팩토리얼은 정수에만 정의되므로 x!에 대해서는 x를 int로 변환하여 팩토리얼을 계산하라.
*
***********************************************************************************/
