/*
∟ Class Interface
	∟ Argument types
		∟ 문제는 표기 방식이 지역마다 다르다는 점.
		∟ solution. enum class Month 타입을 사용
		열거형(enumeration)을 사용함으로써 상징적인 이름(symbolic name)을 
		사용할 수 있습니다.

*/

/*************************************************************************
*	의미있는 불변조건을 설정안해도 되므로 struct로 Year.							
**************************************************************************/
struct Year
{
	int y;
};

/*************************************************************************
*	
**************************************************************************/
enum class  Month {
	jan = 1, feb, mar, apr, may, jun, jul, aug, sep, oct, nov, dec
};



/*************************************************************************
*							
**************************************************************************/
class my_Date {

public:
	my_Date(Year y, Month m, int d);
private:
	Year y;
	Month m;
	int d;
};

int main() {

	my_Date{ Year{2025},Month::oct,11 };

}