/************************************************************************
*
	이차방정식(quadratic equation)은 a* x² + b * x + c = 0의 형태를 갖는다.
	이를 풀기 위해서는 근의 공식(quadratic formula)을 사용한다:
	x = (-b ± √(b² - 4ac)) / 2a 
	단, b² - 4ac가 0보다 작으면 실근(real root)이 존재하지 않으므로 
	계산에 실패한다.이차방정식의 해를 계산하는 프로그램을 작성하시오.
	a, b, c를 입력받아 근을 출력하는 함수를 작성하고, 
	실근이 없을 경우 메시지를 출력하시오.
	결과가 타당한지 어떻게 확인할 수 있는가 ? 정확성을 검증할 수 있는가 ?
*
*************************************************************************/
import std;
using namespace std;

int main(void)
{
	double vala = -1, valb = -1, valc = -1;
	cout << "a, b, c를 입력해주세요." << '\n';

	/* a가 0인 경우 x = -(c/b) */


	/* D = b² - 4ac, D>0. */
	
	/* D = b² - 4ac, D<0, */
	
	/* D = b² - 4ac, D=0, */
	
}