/********************************************************************************
*
	Drill 
	[1] calculator08buggy.cpp 파일을 시작점으로 하여 계산기가 컴파일되도록 하라. 
	[2] 전체 프로그램을 검토하고 적절한 주석을 추가하라. 
	[3] 주석을 추가하는 과정에서 오류를 발견하게 될 것이다(일부러 삽입된 오류). 
	이를 수정하라. 이 오류들은 책 본문에는 포함되어 있지 않다. 
	[4] 테스트: 입력 집합을 준비하여 계산기를 테스트하라. 
	목록이 충분히 포괄적인가? 어떤 점을 확인해야 하는가? 
	음수 값, 0, 매우 작은 값, 매우 큰 값, “엉뚱한” 입력 등을 포함하라. 
	[5] 테스트를 수행하고, 주석 작성 시 놓친 버그를 수정하라. 
	[6] 1000을 의미하는 미리 정의된 이름 k를 추가하라. 
	[7] 사용자에게 제곱근 함수 sqrt()를 제공하라. 
	예: sqrt(2+6.7)   sqrt(x)의 값은 x의 제곱근이며, 예를 들어 sqrt(9)는 3이다. 
	표준 라이브러리의 sqrt() 함수를 사용하여 계산기용 sqrt()를 구현하라. 
	문법(grammar)을 포함하여 주석도 업데이트할 것. 
	[8] 음수에 대해 제곱근을 시도할 경우 적절한 오류 메시지를 출력하도록 하라. 
	[9] 사용자에게 pow(x,i)를 사용할 수 있도록 하라. 이는 “x를 i번 곱한다”는 의미이다. 
	예: pow(2.5,3)는 2.5*2.5*2.5이다. i는 반드시 정수여야 하며, 
	이는 % 연산자에서 사용한 기법을 활용하라 (§6.5 참조). 
	[10] “선언 키워드(declaration keyword)”를 let에서 #으로 변경하라. 
	[11] “종료 키워드(quit keyword)”를 quit에서 exit으로 변경하라. 
	이는 §6.8.2에서 let을 정의한 방식과 유사하게 문자열을 정의해야 한다.

*
*********************************************************************************/