/*******************************************************************************************

	[5] 이 연습문제와 이후 몇 가지 문제는
	도서관 소프트웨어의 일부로 상상할 수 있는 Book 클래스를
	설계하고 구현하는 것을 요구한다.Book 클래스는
	ISBN, 제목(title), 저자(author), 저작권 날짜(copyright date)를 멤버로 가져야 한다.
	또한 해당 도서가 대출 중인지 아닌지를 나타내는 데이터를 저장하시오.
	이러한 데이터 값을 반환하는 함수들을 생성하시오.
	도서를 대출하거나 반납하는 함수들을 생성하시오.
	Book에 입력되는 데이터에 대해 간단한 유효성 검사를 수행하시오.
	예를 들어, ISBN은 n−n−n−x 형식만 허용하되,
	여기서 n은 정수이고 x는 숫자 또는 문자여야 한다.
	ISBN은 문자열(string)로 저장하시오.

*******************************************************************************************/